### 📖 Terraform Plan (infra/resources/psn/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_private_dns_a_record.apim_internal_wallet_io_pagopa_it will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "apim_internal_wallet_io_pagopa_it" {
        id                  = "/subscriptions/f3c27dbc-5c86-4c14-b43f-9faed77e5e19/resourceGroups/pagopa-rg-hub-network-italynorth/providers/Microsoft.Network/privateDnsZones/internal.wallet.io.pagopa.it/A/apim"
        name                = "apim"
        tags                = {}
      ~ ttl                 = 30 -> 3600
        # (4 unchanged attributes hidden)
    }

  # module.function_apps.azurerm_monitor_metric_alert.app_service_plan_cpu_alert will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "app_service_plan_cpu_alert" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iw-p-itn-user-asp-01] High CPU Usage"
        name                     = "[iw-p-itn-user-asp-01] High CPU Usage"
        tags                     = {}
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.azurerm_monitor_metric_alert.function_app_support_response_time will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_support_response_time" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iw-p-itn-support-func-01] Slow Response Time"
        name                     = "[iw-p-itn-support-func-01] Slow Response Time"
        tags                     = {
            "BusinessUnit" = "IT-Wallet"
            "CostCenter"   = "TS000 - Tecnologia e Servizi"
            "CreatedBy"    = "Terraform"
            "Environment"  = "PROD"
            "Source"       = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.function_apps.azurerm_monitor_metric_alert.function_app_user_response_time will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_user_response_time" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iw-p-itn-user-func-01] Slow Response Time"
        name                     = "[iw-p-itn-user-func-01] Slow Response Time"
        tags                     = {
            "BusinessUnit" = "IT-Wallet"
            "CostCenter"   = "TS000 - Tecnologia e Servizi"
            "CreatedBy"    = "Terraform"
            "Environment"  = "PROD"
            "Source"       = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.iam.azurerm_role_assignment.func_app_user_cdn_endpoint_contributor will be created
  + resource "azurerm_role_assignment" "func_app_user_cdn_endpoint_contributor" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user to manage CDN endpoint"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "dc0b9a59-4203-4198-a3c0-49b3d1aa8a11"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "CDN Endpoint Contributor"
      + scope                            = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Cdn/profiles/iw-p-itn-cdn-afd-01/afdEndpoints/iw-p-itn-cdn-fde-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_apps.module.function_app_user.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "AzureWebJobs.migrateWalletInstances.Disabled"                                                     = "0" -> null
          - "PagoPACosmosDbConnectionString"                                                                   = "@Microsoft.KeyVault(VaultName=iw-p-itn-apps-kv-01;SecretName=PagoPACosmosDbConnectionString)" -> null
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                                                                   = "false" -> null
            # (75 unchanged elements hidden)
        }
        id                                             = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/iw-p-itn-user-func-01"
        name                                           = "iw-p-itn-user-func-01"
        tags                                           = {
            "BusinessUnit"  = "IT-Wallet"
            "CostCenter"    = "TS000 - Tecnologia e Servizi"
            "CreatedBy"     = "Terraform"
            "Environment"   = "PROD"
            "ModuleName"    = "azure_function_app"
            "ModuleSource"  = "DX"
            "ModuleVersion" = "4.1.1"
            "Source"        = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (33 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              + "SLOT_TASK_HUBNAME",
              + "AzureFunctionsJobHost__extensions__durableTask__hubName",
                "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsWebHost__hostid",
                "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
                "AzureWebJobs.generateEntityConfiguration.Disabled",
                # (1 unchanged element hidden)
                "AzureWebJobs.sendEmailOnWalletInstanceRevocation.Disabled",
              - "SLOT_TASK_HUBNAME",
              - "AzureFunctionsJobHost__extensions__durableTask__hubName",
              - "AzureFunctionsWebHost__hostid",
            ]
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "AzureWebJobs.migrateWalletInstances.Disabled"                                                     = "1" -> null
          - "PagoPACosmosDbConnectionString"                                                                   = "@Microsoft.KeyVault(SecretUri=https://iw-p-itn-apps-kv-01.vault.azure.net/secrets/PagoPACosmosDbConnectionString)" -> null
            # (75 unchanged elements hidden)
        }
        id                                             = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/iw-p-itn-user-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"  = "IT-Wallet"
            "CostCenter"    = "TS000 - Tecnologia e Servizi"
            "CreatedBy"     = "Terraform"
            "Environment"   = "PROD"
            "ModuleName"    = "azure_function_app"
            "ModuleSource"  = "DX"
            "ModuleVersion" = "4.1.1"
            "Source"        = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_path                             = "/api/wallet/v1/health" -> "/api/v1/wallet/health"
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iw-p-itn-user-func-01] Health Check Failed"
        name                     = "[iw-p-itn-user-func-01] Health Check Failed"
        tags                     = {
            "BusinessUnit"  = "IT-Wallet"
            "CostCenter"    = "TS000 - Tecnologia e Servizi"
            "CreatedBy"     = "Terraform"
            "Environment"   = "PROD"
            "ModuleName"    = "azure_function_app"
            "ModuleSource"  = "DX"
            "ModuleVersion" = "4.1.1"
            "Source"        = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (10 unchanged attributes hidden)

      + action {
          + action_group_id = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/iw-p-itn-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iwpitnuserstfn01] Low Availability"
        name                     = "[iwpitnuserstfn01] Low Availability"
        tags                     = {
            "BusinessUnit"  = "IT-Wallet"
            "CostCenter"    = "TS000 - Tecnologia e Servizi"
            "CreatedBy"     = "Terraform"
            "Environment"   = "PROD"
            "ModuleName"    = "azure_function_app"
            "ModuleSource"  = "DX"
            "ModuleVersion" = "4.1.1"
            "Source"        = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (10 unchanged attributes hidden)

      + action {
          + action_group_id = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/iw-p-itn-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "AzureWebJobs.migrateWalletInstances.Disabled"                                                     = "1" -> null
            # (75 unchanged elements hidden)
        }
        id                                             = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/iw-u-itn-user-func-01"
        name                                           = "iw-u-itn-user-func-01"
        tags                                           = {
            "BusinessUnit"                           = "IT-Wallet"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "PROD"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "4.1.1"
            "Source"                                 = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (33 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
                "SLOT_TASK_HUBNAME",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
            ]
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iw-u-itn-user-func-01] Health Check Failed"
        name                     = "[iw-u-itn-user-func-01] Health Check Failed"
        tags                     = {
            "BusinessUnit"  = "IT-Wallet"
            "CostCenter"    = "TS000 - Tecnologia e Servizi"
            "CreatedBy"     = "Terraform"
            "Environment"   = "PROD"
            "ModuleName"    = "azure_function_app"
            "ModuleSource"  = "DX"
            "ModuleVersion" = "4.1.1"
            "Source"        = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (10 unchanged attributes hidden)

      + action {
          + action_group_id = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/iw-p-itn-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iwuitnuserstfn01] Low Availability"
        name                     = "[iwuitnuserstfn01] Low Availability"
        tags                     = {
            "BusinessUnit"  = "IT-Wallet"
            "CostCenter"    = "TS000 - Tecnologia e Servizi"
            "CreatedBy"     = "Terraform"
            "Environment"   = "PROD"
            "ModuleName"    = "azure_function_app"
            "ModuleSource"  = "DX"
            "ModuleVersion" = "4.1.1"
            "Source"        = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/psn/prod"
        }
        # (10 unchanged attributes hidden)

      + action {
          + action_group_id = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/iw-p-itn-ag-01"
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 11 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.apim.azurerm_api_management.this,
  on .terraform/modules/apim/main.tf line 18, in resource "azurerm_api_management" "this":
  18: resource "azurerm_api_management" "this" {

`key_vault_id` has been deprecated in favour of `key_vault_certificate_id`
and will be removed in v5.0 of the AzureRM provider

(and 5 more similar warnings elsewhere)
```

</details>
